# 判断数据类型
print(type((1,)))
print(type([1, 2]))

# =============================================字符串==================================
# 字符串换行
print("aaa\nbbb\nccc")
# 等同于以下代码
print('''aaa
bbb
ccc''')

# ==============================================布尔值==================================
# 请严格注意大小写
print(True)
print(False)
print(3 > 2)

# 布尔值的转换
print(True and False)
print(not True)
print(True or False)

# ==============================================空值=====================================
print(None)
print(None == 'None')

# ==============================================数值运算=====================================
# 求商精确数值
print(10 / 3)
# 求商整数结果
print(10 // 3)
# 求余
print(10 % 3)
# 类型转换
str = '12312312'
print(int(str))
# print('aaaa' * len(str))
